org/2021-dec-up-summary.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021 年 12 月上旬总结
#+DATE: <2021-12-15 Wed>
#+HUGO_TAGS: 总结
在这个半月，完成的事情：

1. 这一阶段更新的内容
  - 毕业设计
  - 如何理解 JS 中的 (e)
  - 大学的最后一节课
  - 学习的过程
  - ssh =Could not open a connection to your authentication agent.=
  - =ssh-agent=
  - Nginx Redirect
  - 关注牙齿健康
  - scp - OpenSSH secure file copy
  - Git Credential
  - 白蛇 2：青蛇劫起
  - Draw Sky, Cloud
  - 建构自我价值
  - 正确食用「糖」
  - 爱护「眼睛」
  - 疾病
  - 使用 Org Mode 写博客
  - 我什么也没干，只是在好好活着 | 和抑郁情绪共处的 315 天
  - 练习《HTML5 权威指南》
  - 郝斌 C 语言学习：概述、预备知识
  - 使用 Org-mode 为文本添加高亮
  - 用 Puppeteer 下载网页 pdf 版本
  - BIOS 因何而存在
  - 爱自己
  - 隔代的隔阂
  - 如何真正理解一个新概念
  - 张潇雨的 50 条人生准则
  - 建立元搜索引擎
  - Git Add Files to A Commit Except A Single File
  - 极简个性心理学
  - 牧羊少年奇幻之旅
  - 如何写作科技文档
  - 同源策略
  - 如何处理沟通过程中的情绪爆发
  - 脱单指南
  - 随机展示写过的博客
  - LC17. 电话号码的字母组合
  - C 语言中 printf 与 puts 的区别
  - 使用 JSMin 压缩 JavaScript
  - 第一次视频面试——专注前端
2. 看完《郝斌 C 语言学习》概述、预备知识部分，并记笔记
3. 学会如何把除去某文件以外 的其他文件加入一个 git commit；了解了 Git Credential 的作用
4. 学会如果操作 Nginx 让网址重定向
5. 解决了一个 ssh 问题；了解了 ssh-agent
6. 知道如果为 Org-mode 文本添加高亮（使用宏）；终于把「用 Org-mode 写作博客」写出来了
7. 做了一道 LeetCode 算法题目
8. 参加了一次面试

从 1 看，这半个月做了不少事情，这是值得高兴的。但是 15 号的这次面试让我明白：只做这些事情是不能找到工作的。原因有很多：

1. 我还不会使用 Vue 独立开发项目
2. 我还不知道 ES6 的具体内容，怎么使用
3. 类似的还有，HTML5、CSS3 等

所以接下来的所有精力都会放在前端方面，直到能够胜任工作需要。