blog/2021/2021-dec-up-summary.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-01-14 Fri 17:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年 12 月上旬总结</title>
<meta name="generator" content="Org mode">
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年 12 月上旬总结</h1>
</header><p>
在这个半月，完成的事情：
</p>

<ol class="org-ol">
<li>这一阶段更新的内容
<ul class="org-ul">
<li><a href="graduation-thesis.html">毕业设计</a></li>
<li><a href="js-e.html">如何理解 JS 中的 (e)</a></li>
<li><a href="last-class.html">大学的最后一节课</a></li>
<li><a href="process-of-learning.html">学习的过程</a></li>
<li><a href="ssh-connection-agent.html">ssh <code>Could not open a connection to your authentication agent.</code></a></li>
<li><a href="ssh-agent.html"><code>ssh-agent</code></a></li>
<li><a href="nginx-redirect.html">Nginx Redirect</a></li>
<li><a href="human-tooth.html">关注牙齿健康</a></li>
<li><a href="ssh-scp.html">scp - OpenSSH secure file copy</a></li>
<li><a href="git-credential.html">Git Credential</a></li>
<li><a href="white-snake2.html">白蛇 2：青蛇劫起</a></li>
<li><a href="sky-cloud.html">Draw Sky, Cloud</a></li>
<li><a href="build-self-worth.html">建构自我价值</a></li>
<li><a href="sugar.html">正确食用「糖」</a></li>
<li><a href="eyes.html">爱护「眼睛」</a></li>
<li><a href="illness.html">疾病</a></li>
<li><a href="org-mode-blog.html">使用 Org Mode 写博客</a></li>
<li><a href="stay-alive.html">我什么也没干，只是在好好活着 | 和抑郁情绪共处的 315 天</a></li>
<li><a href="definitive-guide-to-html5.html">练习《HTML5 权威指南》</a></li>
<li><a href="haobin-c-0.html">郝斌 C 语言学习：概述、预备知识</a></li>
<li><a href="org-mode-macro.html">使用 Org-mode 为文本添加高亮</a></li>
<li><a href="play-puppeteer.html">用 Puppeteer 下载网页 pdf 版本</a></li>
<li><a href="why-bios.html">BIOS 因何而存在</a></li>
<li><a href="love-myself.html">爱自己</a></li>
<li><a href="generational-barrier.html">隔代的隔阂</a></li>
<li><a href="grasp-a-concept.html">如何真正理解一个新概念</a></li>
<li><a href="zhang-xiao-yu.html">张潇雨的 50 条人生准则</a></li>
<li><a href="meta-search.html">建立元搜索引擎</a></li>
<li><a href="git-add-files-to-commit-except-file.html">Git Add Files to A Commit Except A Single File</a></li>
<li><a href="making-sence-of-people.html">极简个性心理学</a></li>
<li><a href="o-alquimista.html">牧羊少年奇幻之旅</a></li>
<li><a href="write-tech-doc.html">如何写作科技文档</a></li>
<li><a href="same-origin-policy.html">同源策略</a></li>
<li><a href="emotional-communication.html">如何处理沟通过程中的情绪爆发</a></li>
<li><a href="get-rid-of-single.html">脱单指南</a></li>
<li><a href="random-blog.html">随机展示写过的博客</a></li>
<li><a href="lc-17-letter-combinations-of-a-phone-number.html">LC17. 电话号码的字母组合</a></li>
<li><a href="c-printf-puts.html">C 语言中 printf 与 puts 的区别</a></li>
<li><a href="js-jsmin.html">使用 JSMin 压缩 JavaScript</a></li>
<li><a href="first-interview.html">第一次视频面试——专注前端</a></li>
</ul></li>
<li>看完《郝斌 C 语言学习》概述、预备知识部分，并记笔记</li>
<li>学会如何把除去某文件以外 的其他文件加入一个 git commit；了解了 Git Credential 的作用</li>
<li>学会如果操作 Nginx 让网址重定向</li>
<li>解决了一个 ssh 问题；了解了 ssh-agent</li>
<li>知道如果为 Org-mode 文本添加高亮（使用宏）；终于把「用 Org-mode 写作博客」写出来了</li>
<li>做了一道 LeetCode 算法题目</li>
<li>参加了一次面试</li>
</ol>

<p>
从 1 看，这半个月做了不少事情，这是值得高兴的。但是 15 号的这次面试让我明白：只做这些事情是不能找到工作的。原因有很多：
</p>

<ol class="org-ol">
<li>我还不会使用 Vue 独立开发项目</li>
<li>我还不知道 ES6 的具体内容，怎么使用</li>
<li>类似的还有，HTML5、CSS3 等</li>
</ol>

<p>
所以接下来的所有精力都会放在前端方面，直到能够胜任工作需要。</p>
</div>
</body>
</html>